递推公式：a[i]=2*a[i-1]-a[i-2]+2.0/i;
初始条件：a[5005]={0,1,3}

1/1

1/1 1/2
1/2 1/1

1/1 1/2 1/3
1/2 1/1 1/2
1/3 1/2 1/1

 ____________
|1/1  1/2 1/3| 1/4
      ____________
|1/2 |1/1 1/2| 1/3|
|1/3 |1/2 1/1| 1/2|
|____|_______|    |
 1/4 |1/3 1/2  1/1|
     |____________|
#include <stdio.h>
double a[50005]={0,1,3};
int main()
{
	int n,i;
	for (i=3;i<=50000;i++)
		a[i]=2*a[i-1]-a[i-2]+2.0/i;
	while (scanf("%d",&n)!=EOF&&n)
		printf("%.2f\n",a[n]);
	return 0;
}

----------------------------
#include<stdio.h>
int main(){
	double m,j,i;
	while(scanf("%lf",&m)!=EOF&&m!=0){
		j=0;int k=1;
		for(i=m;i>=1;i--)
			j=j+1.00/i*k++;
		printf("%.2f\n",2*j-m);}
	return 0;
}